_posts/2020-01-28-ps-study-list.html
---
title: Problem solving 토픽
tags: ProblemSolving
---

<div id="outline-container-org9508fc6" class="outline-2">
<h2 id="org9508fc6">주제별 분류</h2>
<div class="outline-text-2" id="text-org9508fc6">
</div>
<div id="outline-container-org4d3997f" class="outline-3">
<h3 id="org4d3997f">수학</h3>
<div class="outline-text-3" id="text-org4d3997f">
<ol class="org-ol">
<li>GCD / LCM 구하기</li>
<li>에라토스테네스의 체</li>
</ol>
</div>
</div>

<div id="outline-container-org9ca0341" class="outline-3">
<h3 id="org9ca0341">Array 이용</h3>
</div>

<div id="outline-container-orgb6fd637" class="outline-3">
<h3 id="orgb6fd637">자료구조 구현</h3>
<div class="outline-text-3" id="text-orgb6fd637">
<ol class="org-ol">
<li>스택</li>
<li>큐</li>
<li>최소/최대 힙</li>
<li>리스트</li>
<li>해시테이블</li>
<li>이진트리</li>
<li>LCRS tree</li>
<li>Binary Search Tree</li>
</ol>
</div>
</div>

<div id="outline-container-org37c8edf" class="outline-3">
<h3 id="org37c8edf">비트마스크</h3>
</div>

<div id="outline-container-org6680038" class="outline-3">
<h3 id="org6680038">Sorting</h3>
<div class="outline-text-3" id="text-org6680038">
<ol class="org-ol">
<li>삽입정렬</li>
<li>선택정렬</li>
<li>버블정렬</li>
<li>머지정렬</li>
<li>퀵정렬</li>
<li>Partial Sort</li>
<li>기수정렬</li>
</ol>
</div>
</div>

<div id="outline-container-org16667e8" class="outline-3">
<h3 id="org16667e8">String</h3>
<div class="outline-text-3" id="text-org16667e8">
<ol class="org-ol">
<li>strcmp, strcpy 구현</li>
<li>KMP 알고리즘</li>
<li>접미사 배열</li>
<li>접미사 트리</li>
<li>Trie</li>
<li>Rabin Karp</li>
<li>아호 코라식</li>
</ol>
</div>
</div>

<div id="outline-container-orgc5938ed" class="outline-3">
<h3 id="orgc5938ed">완전탐색 / Brute Force</h3>
</div>

<div id="outline-container-orgf7946da" class="outline-3">
<h3 id="orgf7946da">Graph 알고리즘</h3>
<div class="outline-text-3" id="text-orgf7946da">
<ol class="org-ol">
<li>DFS</li>
<li>BFS</li>
<li>다익스트라</li>
<li>벨만 포드</li>
<li>플로이드 와샬</li>
</ol>
</div>
</div>

<div id="outline-container-orgf145095" class="outline-3">
<h3 id="orgf145095">Minimum Spanning Tree</h3>
<div class="outline-text-3" id="text-orgf145095">
<ol class="org-ol">
<li>크루스컬 알고리즘</li>
<li>프림 알고리즘</li>
</ol>
</div>
</div>

<div id="outline-container-org27636ee" class="outline-3">
<h3 id="org27636ee">Topological Sort</h3>
<div class="outline-text-3" id="text-org27636ee">
<ol class="org-ol">
<li>indegree를 이용하는 방법</li>
<li>dfs를 이용하는 방법</li>
</ol>
</div>
</div>

<div id="outline-container-orga90eaa1" class="outline-3">
<h3 id="orga90eaa1">Greedy Method</h3>
</div>

<div id="outline-container-org967ad67" class="outline-3">
<h3 id="org967ad67">이분탐색</h3>
<div class="outline-text-3" id="text-org967ad67">
<ol class="org-ol">
<li>Lower bound / Upper bound</li>
<li>Parametric Search</li>
</ol>
</div>
</div>

<div id="outline-container-org50d5549" class="outline-3">
<h3 id="org50d5549">Dynamic Programing</h3>
<div class="outline-text-3" id="text-org50d5549">
<ol class="org-ol">
<li>동전교환 문제 가짓수</li>
<li>동전교환 문제 최소 동전수</li>
<li>LIS를 DP로 구현 + 경로 출력</li>
<li>LIS를 lower bound로 구현 + 경로 출력</li>
<li>기업투자 문제를 DP로 구현 + 선택 내용 출력</li>
<li>0/1 knapsack DP 구현 + 선택 내용 출력</li>
<li>LCS</li>
<li>최소 비용 이동(left and down방향)</li>
<li>가장 긴 연속적으로 증가하는 부분 수열 (LIS와 다름)</li>
</ol>
</div>
</div>

<div id="outline-container-org3b719f0" class="outline-3">
<h3 id="org3b719f0">트리 알고리즘</h3>
<div class="outline-text-3" id="text-org3b719f0">
<ol class="org-ol">
<li>트리를 표현하는 방법</li>
<li>트리의 탐색(전위/중위/후위)</li>
<li>트리의 지름 구하기</li>
<li>LCA (최소 공통 조상 구하기)</li>
</ol>
</div>
</div>

<div id="outline-container-org6b4d60a" class="outline-3">
<h3 id="org6b4d60a">Union Find</h3>
</div>

<div id="outline-container-org81e4db3" class="outline-3">
<h3 id="org81e4db3">Index Tree</h3>
</div>

<div id="outline-container-org5227206" class="outline-3">
<h3 id="org5227206">Segment Tree</h3>
</div>

<div id="outline-container-org3374383" class="outline-3">
<h3 id="org3374383">시뮬레이션 문제들</h3>
</div>
</div>

<div id="outline-container-org0a70868" class="outline-2">
<h2 id="org0a70868">참고자료</h2>
<div class="outline-text-2" id="text-org0a70868">
<ul class="org-ul">
<li><a href="https://www.topcoder.com/community/competitive-programming/tutorials/">Topcoder tutorial</a></li>
<li><a href="https://cp-algorithms.com/">E-Maxx Algorithms in English</a></li>
<li><a href="https://www.codechef">Introductory tutorials for competitive programming</a></li>
</ul>
</div>
</div>
